[
    {
        "Név": "Bikeshed",
        "Leírás": "Bikeshed is a pre-processor for spec documents, turning a source document into a final spec document, with appropriate boilerplate, bibliography, indexes, etc all filled in. It's used on specs for CSS and many other W3C working groups, WHATWG, the C++ standards committee, and elsewhere!"
    },
    {
        "Név": "Cirrus",
        "Leírás": "Cirrus is a modular, responsive, and component centric SCSS framework aimed at bringing not only beautiful, hassle-free styling, but also a better developer experience. Almost all generated styles can be modified via its config style so you can mold the framework to whatever you want."
    },
    {
        "Név": "Gatsby",
        "Leírás": "Gatsby is an open-source static site generator built on top of Node.js using React and GraphQL. It provides over 2500 plugins to create static sites based on sources as Markdown documents, MDX, images, and numerous Content Management Systems such as WordPress, Drupal and more."
    },
    {
        "Név": "Grunt",
        "Leírás": "Grunt is a JavaScript task runner, a tool used to automatically perform frequent tasks such as minification, compilation, unit testing, and linting. Grunt uses a custom configuration file to specify the tasks you want to run, and uses Node.js to run the tasks."
    },
    {
        "Név": "Gulp",
        "Leírás": "Gulp is a toolkit for automating painful or time-consuming tasks in your development workflow, so you can stop messing around and build something."
    },
    {
        "Név": "Horde",
        "Leírás": "Horde is a collection of PHP libraries and applications that provide a framework for building web-based applications. Horde is a community of developers who work together to create a set of PHP libraries and applications that provide a framework for building web-based applications."
    },
    {
        "Név": "Hugo",
        "Leírás": "Hugo is a static site generator written in Go. It is optimized for speed, ease of use, and configurability. Hugo takes a directory with content and templates and renders them into a full HTML website. Hugo is designed to work well for any kind of website including blogs, tumbles, and docs. Twitter Community Notes uses it."
    },
    {
        "Név": "Torch",
        "Leírás": "Torch is a scientific computing framework with wide support for machine learning algorithms that puts GPUs first. It is easy to use and efficient, thanks to an easy and fast scripting language, LuaJIT, and an underlying C/CUDA implementation. PyTorch is an open source machine learning library based on the Torch library, used for applications such as computer vision and natural language processing, primarily developed by Facebook's AI Research lab and now maintained by the PyTorch team under the Linux Foundation."
    },
    {
        "Név": "pandas",
        "Leírás": "pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language. In particular, it offers data structures and operations for manipulating numerical tables and time series."
    },
    {
        "Név": "Phalcon",
        "Leírás": "Phalcon is another PHP web framework that uses the MVC pattern but is written as a C extension. It is a full-stack framework that provides a complete set of tools to develop web applications. It is a high-performance framework that can be used to build websites and web applications."
    },
    {
        "Név": "Mojolicious",
        "Leírás": "Mojolicious is a full-featured web framework for the Perl programming language. It is designed to make web development fun again. It provides you with routes, commands, plugins, templates, testing frameworks, first-class Unicode support, and many other features."
    },
    {
        "Név": "CodeIgniter",
        "Leírás": "CodeIgniter is a powerful PHP framework with a very small footprint, built for developers who need a simple and elegant toolkit to create full-featured web applications. It is most often noted for its speed when compared to other PHP frameworks."
    },
    {
        "Név": "PhoneGap",
        "Leírás": "PhoneGap is a free and open source framework that allows you to create mobile apps using standardized web APIs for the platforms you care about. It is a distribution of Cordova, the popular open source project maintained by the Apache Software Foundation."
    },
    {
        "Név": "Nightwatch",
        "Leírás": "Nightwatch is an automated testing framework for web applications and websites, written in Node.js and using the W3C WebDriver API. It is easy to use and supports advanced selectors and assertions, as well as page object models. It is also extensible using a simple plugin architecture."
    },
    {
        "Név": "Scrapy",
        "Leírás": "Scrapy is a free and open source web crawling framework written in Python. It is used to extract the data you need from websites. In a fast, simple, yet extensible way. It can be used for a wide range of purposes, from data mining to monitoring and automated testing."
    },
    {
        "Név": "Electron",
        "Leírás": "Electron is a framework for creating native applications with web technologies like JavaScript, HTML, and CSS. It takes care of the hard parts so you can focus on the core of your application. It is based on Node.js and Chromium and is used by Discord, Figma, VS Code, and many others."
    },
    {
        "Név": "MEMORY",
        "Leírás": "MEMORY is a storage engine for MySQL and MariaDB relational database management systems, developed by Oracle and MariaDB. It is designed to store data that must be accessed quickly, for example caches, or intermediate data that needs to be transformed before storing it to regular tables."
    },
    {
        "Név": "MyRocks",
        "Leírás": "MyRocks is open-source software developed at Facebook in order to use MySQL features with RocksDB implementations. MyRock's efficiency focuses on better space efficiency, better write efficiency, and better read efficiency."
    },
    {
        "Név": "Federated",
        "Leírás": "Federated is a storage engine for the MySQL MariaDB relational database management system that allows to create a table that is a local representation of a foreign (remote) table. It uses the MySQL client library API as a data transport, treating remote tables as if they were located on the local server. "
    },
    {
        "Név": "BaseX",
        "Leírás": "BaseX is a native and light-weight XML database management system and XQuery processor, developed as a community project on GitHub."
    },
    {
        "Név": "Caché",
        "Leírás": "InterSystems Caché is a commercial operational database management system. It is a relational database management system (RDBMS) that supports SQL and ACID transactions. It is used for storing and retrieving data in a variety of applications, including healthcare, financial services, and telecommunications."
    },
    {
        "Név": "eXist",
        "Leírás": "eXist is a native XML database, a NoSQL database, and a XQuery 3.1 processor. It is a free and open source software, developed as a community project on GitHub."
    },
    {
        "Név": "Virtuoso",
        "Leírás": "Virtuoso Universal Server is a middleware and database engine hybrid that combines the functionality of a traditional relational database management, object-relational database, virtual database, RDF, XML, free-text, web application server and file server functionality in a single system. Rather than have dedicated servers for each of the aforementioned functionality realms, Virtuoso is a \"universal server\"."
    },
    {
        "Név": "Apache Ignite",
        "Leírás": "Apache Ignite is a distributed database management system for high-performance computing, and its database utilizes RAM as the default storage."
    },
    {
        "Név": "Starcounter",
        "Leírás": "Starcounter is a database management system that uses a relational model and SQL as its query language. It is a native object database that stores data in memory and uses a transaction log to persist data to disk."
    },
    {
        "Név": "SpiderMonkey",
        "Leírás": "SpiderMonkey is the first JavaScript engine, written by Brendan Eich at Netscape Communications, later released as open source and currently maintained by the Mozilla Foundation. It is used in the Firefox web browser."
    },
    {
        "Név": "KJS",
        "Leírás": "KJS is KDE's ECMAScript-JavaScript engine that was originally developed for the KDE project's Konqueror web browser by Harri Porten."
    },
    {
        "Név": "Stalin",
        "Leírás": "Stalin (STAtic Language ImplementatioN) is a programming language, an aggressive optimizing batch whole-program Scheme compiler. It runs slowly, with little or no support for debugging or other niceties. The name is a joke: \"Stalin brutally optimizes.\""
    },
    {
        "Név": "Smalltalk",
        "Leírás": "Smalltalk was designed and created in part for educational use. It is a general-purpose, object-oriented, dynamically typed, reflective programming language, meaining that is has the ability to inspect its own structure and behavior at runtime."
    },
    {
        "Név": "Bitwarden",
        "Leírás": "Bitwarden is a free and open source password management service that stores sensitive information such as website credentials, credit card details, and SSH keys in an encrypted vault. It is available as a web application, browser extension, and mobile application."
    },
    {
        "Név": "Password Safe",
        "Leírás": "Password Safe is a free and open source password manager developed by Bruce Schneier. It is available for Windows, macOS, and Linux. It is a cross-platform password manager that stores passwords in an encrypted database."
    },
    {
        "Név": "Django",
        "Leírás": "Django is a free and open-source, Python-based web framework that follows the model-template-views (MTV) architectural pattern. Django's primary goal is to ease the creation of complex, database-driven websites. The framework emphasizes reusability and \"pluggability\" of components, less code, low coupling, rapid development, and the principle of don't repeat yourself."
    },
    {
        "Név": "Ruby on Rails",
        "Leírás": "Ruby on Rails is a server-side web application framework written in Ruby. It is a model-view-controller (MVC) framework, providing default structures for a database, a web service, and web pages."
    },
    {
        "Név": "XOOPS",
        "Leírás": "XOOPS is a free open-source content management system (CMS), written in PHP. It uses a modular architecture allowing users to customize, update and theme their websites."
    },
    {
        "Név": "NTLDR",
        "Leírás": "NTLDR is the boot loader for all releases of Windows NT operating system from 1993 with the release of Windows NT 3.1 up until Windows XP."
    },
    {
        "Név": "SYSLINUX",
        "Leírás": "SYSLINUX is a bootloader for the Linux operating system (OS) that is specifically designed for booting from a CD-ROM, USB drive, or network. It is a lightweight bootloader that is easy to install and customize, and it supports a wide range of hardware platforms."
    },
    {
        "Név": "Vim",
        "Leírás": "Vim is a command-line text editor, that runs in a terminal emulator. It increases productivity by making it very hard to exit the editor."
    },
    {
        "Név": "Yew",
        "Leírás": "Yew is a modern Rust framework for creating multi-threaded front-end web apps with WebAssembly. It achieves high performance by minimizing DOM API calls for each page render and by making it easy to offload processing to background web workers."
    },
    {
        "Név": "Keras",
        "Leírás": "Keras is an open-source software library that provides a Python interface for artificial neural networks. Keras acts as an interface for the TensorFlow library. It was developed with a focus on enabling fast experimentation."
    },
    {
        "Név": "Caffe",
        "Leírás": "Caffe is a deep learning framework made with expression, speed, and modularity in mind. It is developed by Berkeley AI Research"
    },
    {
        "Név": "CoffeeScript",
        "Leírás": "CoffeeScript is a programming language that transcompiles to JavaScript. It adds syntactic sugar inspired by Ruby, Python, and Haskell in an effort to enhance JavaScript's brevity and readability."
    },
    {
        "Név": "Tkinter",
        "Leírás": "Tkinter is a Python module that provides a simple and easy-to-use interface to the Tk GUI (Graphical User Interface) toolkit, and is Python's de facto standard GUI."
    },
    {
        "Név": "TACTIC",
        "Leírás": "TACTIC is a web-based, open source workflow platform and digital asset management system. It uses a hierarchical drawing engine to deliver self-contained HTML5 widgets to a browser. Each widget is an encapsulated bundle of HTML, JavaScript, CSS (cascading style sheets) and server-side Python code."
    },
    {
        "Név": "Camping",
        "Leírás": "Camping is a web application microframework written in Ruby. Camping's source code is less than 4 KB in size. Camping stores a complete fledgling web application in a single file, like a bundle of many small CGI scripts, but organizes it as a model-view-controller application"
    },
    {
        "Név": "Raygun",
        "Leírás": "Raygun is a cloud-based error and performance monitoring service for web and mobile applications. Crash reports, real-time user tracking, and finding application performance bottlenecks are all made easier with it."
    },
    {
        "Név": "NetBeans",
        "Leírás": "NetBeans is an integrated development environment (IDE) for developing applications in Java, JavaScript, PHP, C/C++ and other programming languages. It is open-source and is developed by Oracle Corporation."
    },
    {
        "Név": "AutoIt",
        "Leírás": "AutoIt is a freeware programming language for Microsoft Windows. In its earliest release, it was primarily intended to create automation scripts for Microsoft Windows programs but has since grown to include enhancements in both programming language design and overall functionality."
    },
    {
        "Név": "Babel",
        "Leírás": "Babel is a JavaScript compiler. It is used to convert ECMAScript 2015+ code into a backwards compatible version of JavaScript in current and older browsers or environments."
    },
    {
        "Név": "PyCharm",
        "Leírás": "PyCharm is an integrated development environment (IDE) used in computer programming, specifically for the Python language. It is developed by the Czech company JetBrains. It provides code analysis, a graphical debugger, an integrated unit tester, integration with version control systems (VCSes), and supports web development with Django as well as data science with Anaconda."
    },
    {
        "Név": "JAX",
        "Leírás": "JAX is a Python library for numerical computation that is developed and maintained by Google. It is built on top of NumPy, a popular library for numerical computing, and provides additional functionality for machine learning, optimization, and automatic differentiation."
    },
    {
        "Név": "triton",
        "Leírás": "triton is a language and compiler for writing highly efficient custom Deep-Learning primitives. The aim of Triton is to provide an open-source Python-like environment to write fast code at higher productivity than CUDA, but also with higher flexibility than other existing DSLs."
    },
    {
        "Név": "Tailwind",
        "Leírás": "Tailwind CSS is an open source utility-first CSS framework. The main feature of this library is that, unlike other CSS frameworks like Bootstrap, it does not provide a series of predefined classes for elements such as buttons or tables."
    },
    {
        "Név": "TupiTube",
        "Leírás": "TupiTube is a free and open-source 2D animation software that is focused on usability for children, teenagers, and amateur artists."
    },
    {
        "Név": "Synfig",
        "Leírás": "Synfig is a free and open-source vector-based 2D animation software. The goal of the developers is to create a program that is capable of producing \"feature-film quality animation with fewer people and resources\"."
    },
    {
        "Név": "Harmony",
        "Leírás": "Harmony is a Java-based software for creating high-definition music videos with 2D and 3D animations. The application was developed by Digital Chaotics."
    },
    {
        "Név": "Ajax",
        "Leírás": "Ajax is a set of web development techniques that uses various web technologies on the client-side to create asynchronous web applications. With Ajax, web applications can send and retrieve data from a server asynchronously without interfering with the display and behaviour of the existing page."
    },
    {
        "Név": "Ajax Animator",
        "Leírás": "Ajax Animator is a free, web-based animation suite. It is primarily written using JavaScript, the Ext JS framework, and HTML5-related technologies such as SVG."
    },
    {
        "Név": "iClone",
        "Leírás": "iClone is a real-time 3D animation software developed by Reallusion. It is designed for 3D game development, virtual reality, and character animation."
    },
    {
        "Név": "Messiah",
        "Leírás": "Messiah (also known as messiah:studio) is a 3D animation and rendering application developed by pmG Worldwide. Messiah has been used for character animation and the creation of VFX shots in several feature films and shorts."
    },
    {
        "Név": "Anim8or",
        "Leírás": "Anim8or is a freeware OpenGL-based 3D modeling and animation program by R. Steven Glanville, a software engineer at NVidia."
    },
    {
        "Név": "OGRE",
        "Leírás": "Object-Oriented Graphics Rendering Engine (OGRE) is a scene-oriented, real-time, open-source, 3D rendering engine."
    },
    {
        "Név": "Three.js",
        "Leírás": "Three.js is a popular cross-browser JavaScript library and application programming interface (API) used to create and display animated 3D computer graphics in a web browser. Three.js uses WebGL."
    },
    {
        "Név": "SPLAT!",
        "Leírás": "SPLAT! (short for an RF Signal Propagation, Loss, And Terrain analysis tool[1]) is a GNU GPL-licensed terrestrial radio propagation model application initially written for Linux but has since been ported for Windows and OS X."
    },
    {
        "Név": "EchoLink",
        "Leírás": "EchoLink is a computer-based Amateur Radio system distributed free of charge that allows radio amateurs to communicate with other amateur radio operators using Voice over IP (VoIP) technology on the Internet."
    },
    {
        "Név": "XAMPP",
        "Leírás": "XAMPP is a free and open-source cross-platform web server solution stack package developed by Apache Friends, consisting mainly of the Apache HTTP Server, MariaDB database, and interpreters for scripts written in the PHP and Perl programming languages. XAMPP is so buggy it almost qualifies as malware."
    },
    {
        "Név": "DAMP",
        "Leírás": "DAMP is a solution stack of computer software, that is used to run dynamic Web sites or servers. The acronym stands for Darwin, Apache, MySQL, and PHP."
    },
    {
        "Név": "LAMP",
        "Leírás": "LAMP is an acronym for Linux, Apache, MySQL, and PHP. The LAMP components are largely interchangeable and not limited to the original selection. As a solution stack, LAMP is suitable for building dynamic Web sites and Web applications."
    },
    {
        "Név": "Duplicati",
        "Leírás": "Duplicati is a backup client that securely stores encrypted, incremental, compressed remote backups of local files on cloud storage services and remote file servers."
    },
    {
        "Név": "Bacula",
        "Leírás": "Bacula is an open-source, enterprise-level computer backup system for heterogeneous networks. It is designed to automate backup tasks that had often required intervention from a systems administrator or computer operator."
    },
    {
        "Név": "Back In Time",
        "Leírás": "Back In Time is a backup application for Linux. It uses rsync as backend and has the characteristic feature of using hard links for files which are identical in snapshots at different times, thus using disk space just once for files that remained unchanged."
    },
    {
        "Név": "HYSYS",
        "Leírás": "Aspen HYSYS (or simply HYSYS) is a chemical process simulator currently developed by AspenTech used to mathematically model chemical processes, from unit operations to full chemical plants and refineries."
    },
    {
        "Név": "Check Point",
        "Leírás": "Check Point is an American-Israeli multinational provider of software and combined hardware and software products for IT security."
    },
    {
        "Név": "Dr.Web",
        "Leírás": "Dr.Web is a software suite developed by Russian anti-malware company Doctor Web. First released in 1992, it became the first anti-virus service in Russia."
    },
    {
        "Név": "Sheetgo",
        "Leírás": "Sheetgo is a cloud-based automation tool that allows users to transfer data between spreadsheets and other office apps."
    },
    {
        "Név": "GnuCash",
        "Leírás": "GnuCash is an accounting program that implements a double-entry bookkeeping system. It is part of the GNU Project."
    },
    {
        "Név": "recordMyDesktop",
        "Leírás": "recordMyDesktop is a free and open source desktop screencasting software application written for Linux."
    },
    {
        "Név": "Harvest",
        "Leírás": "Harvest is a web-based time tracking tool, which was one of the first software as a service applications to be built on the Ruby on Rails framework, and is listed as one of the most prolific by its creators."
    },
    {
        "Név": "Timely",
        "Leírás": "Timely is an automatic time tracking software."
    },
    {
        "Név": "FogBugz",
        "Leírás": "FogBugz is an integrated web-based project management system featuring bug and issue tracking, discussion forums, wikis, customer relationship management, and evidence-based scheduling originally developed by Fog Creek Software."
    },
    {
        "Név": "OpenFOAM",
        "Leírás": "OpenFOAM is a C++ toolbox for the development of customized numerical solvers, and pre-/post-processing utilities for the solution of continuum mechanics problems, most prominently including computational fluid dynamics."
    },
    {
        "Név": "SIMMON",
        "Leírás": "SIMMON (SIMulation MONitor) was a proprietary software testing system developed in the late 1960s in the IBM Product Test Laboratory."
    },
    {
        "Név": "Segger",
        "Leírás": "Segger Microcontroller, founded in 1992, is a private company involved in the embedded systems industry. It provides products used to develop and manufacture four categories of embedded systems."
    },
    {
        "Név": "Valgrind",
        "Leírás": "Valgrind is a programming tool for memory debugging, memory leak detection, and profiling."
    },
    {
        "Név": "Ups",
        "Leírás": "Ups is an open source source-level debugger developed in the late 1980s for Unix and Unix-like systems."
    },
    {
        "Név": "SheepShaver",
        "Leírás": "SheepShaver is an open-source PowerPC Apple Macintosh emulator originally designed for BeOS and Linux."
    },
    {
        "Név": "Wine",
        "Leírás": "Wine (formerly a recursive backronym for Wine Is Not an Emulator, now just \"Wine\") is a free and open-source compatibility layer that aims to allow application software and computer games developed for Microsoft Windows to run on Unix-like operating systems."
    },
    {
        "Név": "Rufus",
        "Leírás": "Rufus is a free and open-source portable application for Microsoft Windows that can be used to format and create bootable USB flash drives or Live USBs."
    },
    {
        "Név": "DreamBooth",
        "Leírás": "DreamBooth is a deep learning generation model used to fine-tune existing text-to-image models (such as Stable Diffusion), developed by researchers from Google Research and Boston University in 2022."
    },
    {
        "Név": "Waitroom",
        "Leírás": "Waitroom is a host-led livestreaming and video meeting platform that allows one-on-one engagement between hosts and their audiences. These engagements can range from 30 seconds to 30 minutes long. Waitroom was co-founded in the summer of 2020."
    },
    {
        "Név": "SafeMoon",
        "Leírás": "SafeMoon LLC is a cryptocurrency and blockchain company created in March 2021. The company also has a SafeMoon token (SFM) which trades on the Binance Smart Chain blockchain. The token charges a 10% fee on transactions."
    },
    {
        "Név": "DeepSpeed",
        "Leírás": "DeepSpeed is an open source deep learning optimization library for PyTorch. The library is designed to reduce computing power and memory use and to train large distributed models with better parallelism on existing computer hardware. The DeepSpeed source code is licensed under MIT License and available on GitHub."
    },
    {
        "Név": "Clubhouse",
        "Leírás": "Clubhouse is a social audio app released in 2020 for iOS and Android where users can communicate in audio chat rooms that accommodate groups of thousands of people. Clubhouse led to the emergence of a new social media segment known as social audio or drop-in audio."
    },
    {
        "Név": "Gas",
        "Leírás": "Gas, formerly known as Melt as well as Crush, is an American anonymous social media app. Launched in August 2022, the app is oriented towards high schoolers."
    },
    {
        "Név": "Libgcrypt",
        "Leírás": "Libgcrypt is a cryptography library developed as a separated module of GnuPG. It provides the basic functions for encryption, decryption, signatures, message authentication codes, and a few other cryptographic primitives."
    },
    {
        "Név": "Celia",
        "Leírás": "Celia is an artificially intelligent virtual assistant developed by Huawei for their latest HarmonyOS and Android-based EMUI smartphones that lack Google Services and a Google Assistant. The assistant can perform day-to-day tasks, which include making a phone call, setting a reminder and checking the weather."
    },
    {
        "Név": "Clova",
        "Leírás": "Clova is a virtual assistant developed by Naver, a South Korean internet company. It is available in Korean, Japanese, and English. Clova is available on smartphones, smart speakers, and smart TVs."
    },
    {
        "Név": "Bixby",
        "Leírás": "Bixby is a virtual assistant developed by Samsung Electronics. In May 2017, Samsung announced that Bixby would be coming to its line of Family Hub 2.0 refrigerators, making it the first non-mobile product to include the virtual assistant."
    },
    {
        "Név": "Alice",
        "Leírás": "Alice is a Russian intelligent personal assistant for Android, iOS and Windows operating systems and Yandex's own devices developed by Yandex. Alice was officially introduced on 10 October 2017. Aside from common tasks, such as internet search or weather forecasts, it can also run applications."
    },
    {
        "Név": "PeduliLindungi",
        "Leírás": "PeduliLindungi is the official COVID-19 contact tracing app used for digital contact tracing in Indonesia. On 23 August 2021, Coordinating Minister for Maritime and Investments Affairs, Luhut Binsar Panjaitan, encouraged the government to make this app a mandatory requirement before using public transportations, such as train, bus, ferry, and plane. Furthermore, citizen must have installed the app before entering shopping malls, factories, and sport venues. In September 2021, stored personal data of at least 1.3 million Indonesian residents were leaked online, including the vaccine certificate of President Joko Widodo."
    },
    {
        "Név": "TVING",
        "Leírás": "TVING is a South Korean online streaming service operated by TVING Corporation, a joint venture of CJ E&M (CJ Group), Naver and JTBC. It is a platform that streams dramas, entertainment shows, exclusive television films and specials."
    },
    {
        "Név": "Viki",
        "Leírás": "Rakuten Viki is an American video streaming website. It streams videos similar to other services, but also allows users to subtitle content available in 200 languages as well as provides original programming. Headquartered in San Mateo, California, it has offices in Singapore, Tokyo, Japan, and Seoul, South Korea."
    },
    {
        "Név": "Crunchyroll",
        "Leírás": "Crunchyroll is an American subscription video on-demand over-the-top streaming service owned by Sony through a joint venture between Sony Pictures and Sony Music Entertainment Japan's Aniplex. The service primarily distributes films and television series produced by East Asian media, including Japanese anime."
    },
    {
        "Név": "Microsoft Classroom",
        "Leírás": "Microsoft Classroom was an online blended learning platform for schools that aimed to simplify grading assignments and student communication in a paperless way. It was introduced for Office 365 Education subscribers in April 2016. On May 18, 2017 Microsoft announced the retirement of Microsoft Classroom."
    },
    {
        "Név": "Sxmo",
        "Leírás": "Sxmo is a user interface for mobile devices with Linux. It is a collection of suckless tools and scripts, with the intention to create a fully functional interface adhering to the Unix philosophy."
    },
    {
        "Név": "suckless",
        "Leírás": "suckless.org is a free software community of programmers working on projects with a focus on minimalism, simplicity, clarity, and frugality. The group developed the dwm and wmii window managers, surf tabbed, and other programs that are said to adhere strictly to the Unix philosophy of \"doing one thing and doing it well\"."
    },
    {
        "Név": "TraceTogether",
        "Leírás": "TraceTogether is a digital system implemented by the Government of Singapore to facilitate contact tracing efforts in response to the COVID-19 pandemic in Singapore. The main goal is quick identification of persons who may have come into close contact with anyone who has tested positive for COVID-19. It's on GitHub tho."
    },
    {
        "Név": "Bosque",
        "Leírás": "Bosque is a free and open-source programming language designed & developed by Microsoft that was inspired by the syntax and types of TypeScript and the semantics of ML and Node/JavaScript. Design goals for the language include better software quality and improved developer productivity."
    },
    {
        "Név": "Chirp",
        "Leírás": "Chirp is a U.S. based audiobook retail service. It allows users to and stream audiobooks directly from the website or in the app, and is an a la carte retailer, not a subscription based model. The company does not rely on monthly subscriptions and provides discounted prices to its users."
    },
    {
        "Név": "Sanctuary",
        "Leírás": "Sanctuary is a mobile app focusing on astrology and mystical services. Users enter their birthday, time of birth, and place of birth information into the app and receive a birth chart as well as daily horoscope readings. Users can also sign up for a monthly membership and receive on-demand astrological readings via a text message format."
    },
    {
        "Név": "DeepNude",
        "Leírás": "DeepNude a downloadable Windows and Linux application that used neural networks, specifically generative adversarial networks (GAN), to remove clothing from images of women. The app had both a paid and unpaid version, the paid version costing $50. On June 27 2019, the creators removed the application and refunded consumers, although various copies of the app, both free and for charge, continue to exist. On GitHub, the open-source version of this program called \"open-deepnude\" was deleted."
    },
    {
        "Név": "Redkey USB",
        "Leírás": "Redkey USB is a computer utility developed to securely erase data. It is sold as a bootable live USB drive from which the Redkey software can be used on a perpetual license basis. During 2019, a second Redkey crowdfunding campaign went viral on Indiegogo following a video review by Linus Tech Tips."
    },
    {
        "Név": "Rainway",
        "Leírás": "Rainway is a video game streaming service. Rainway allows users to run games on their Windows 10 PC and play them on other devices over an internet connection. Rainway is compatible with games purchased from Steam, Origin, Battle.net, itch.io, GOG.com and Uplay. The service can run in web browsers and will also be compatible with iOS and Android mobile phones, as well as Xbox One consoles."
    },
    {
        "Név": "Proton",
        "Leírás": "Proton is a compatibility layer for Microsoft Windows games to run on Linux-based operating systems. Proton is developed by Valve in cooperation with developers from CodeWeavers. It is a collection of software and libraries combined with a patched version of Wine to improve performance and compatibility with Windows games. Proton is officially distributed through the Steam client."
    },
    {
        "Név": "Terra",
        "Leírás": "Terra is a blockchain protocol and payment platform used for algorithmic stablecoins. The project was created in 2018 by Terraform Labs, a startup co-founded by Do Kwon and Daniel Shin."
    },
    {
        "Név": "CatBoost",
        "Leírás": "CatBoost is an open-source software library developed by Yandex. It provides a gradient boosting framework which among other features attempts to solve for Categorical features using a permutation driven alternative compared to the classical algorithm."
    },
    {
        "Név": "Ballerina",
        "Leírás": "Ballerina is an open-source programming language for the cloud that makes it easier to use, combine, and create network services."
    },
    {
        "Név": "Slowly",
        "Leírás": "Slowly is a geosocial networking application that allows users to exchange delayed messages or \"letters\". The time taken by a message to be delivered depends on the distance between the sender and the recipient."
    },
    {
        "Név": "Phosh",
        "Leírás": "Phosh (portmanteau of phone and shell) is a graphical user interface designed for mobile and touch-based devices. It is the default shell used on several mobile Linux operating systems including PureOS, Mobian, and Fedora Mobility. It is also an option on postmarketOS, Manjaro, and openSUSE."
    },
    {
        "Leírás": "Peeple is a mobile application that allows people to leave recommendations for other people based on professional, personal, and romantic relationships. Initially described as a \"Yelp for People\"."
    },
    {
        "Név": "Vulkan",
        "Leírás": "Vulkan is a cross-platform application programming interface (API) for rendering 2D and 3D graphics. It is developed by the Khronos Group, a non-profit consortium of companies creating open standards for the development of parallel computing and graphics."
    },
    {
        "Név": "Thiruvananthapuram City Police Mobile App",
        "Leírás": "This is the official mobile application for the citizens and public by the Thiruvananthapuram City Police in Kerala, India. The main interface consists of a large red \"PANIC\" button."
    },
    {
        "Név": "Trackbuster",
        "Leírás": "Trackbuster is an online service used to identify and remove email trackers."
    }
]
